Revit 2027 API
AnalyticalMember.CrossSectionRotation Property
 This represents the cross-section rotation, in radians.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CrossSectionRotation { get; set; }
Public Property CrossSectionRotation As Double
	Get
	Set
public:
property double CrossSectionRotation {
	double get ();
	void set (double value);
}
member CrossSectionRotation : float with get, set
Property Value
Double
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace